/*
如下数列，前5项分别是1/1，1/2，2/1，3/1，2/2……。输入n，输出第n项。
1/1   1/2   1/3   1/4   1/5
2/1   2/2   2/3   2/4
3/1   3/2   3/3
4/1   4/2
5/1
样例输入
3
14
7
12345
样例输出
2/1
2/4
1/4
59/99
PS:
将cantor换成金字塔型便于观察 ，==> \ <==表示顺序 
				1/1					==>
			2/1 	1/2				<==
		3/1 	2/2 	1/3			==>
	4/1 	3/2 	2/3 	1/4		<==
5/1 	4/2 	3/3 	2/4 	1/5 ==>
奇数行和偶数行的情况不一样，要分开讨论
在得到n的第k行后，再求出n是该行的第几项，那么 
n在奇数行就是顺数第几个 
n在偶数行就是逆数第几个 
*/ 
#include<stdio.h>
int main()
{
	int n;
	while(scanf("%d",&n) == 1)
	{
		int k = 1, s = 0;
		//找到最小行k，使k的前k项和恰好大于n 
		while(n > s)
		{
			s += k;
			k++;
		}
		k--;//减去多加的一项 
		n = n - (s - k);//将n变为第k行的第n项(奇数行),或倒数第n项(偶数行) 
		if(k % 2 == 0)
		{
			printf("%d/%d\n",n ,k - n + 1);
		}
		else
		{
			printf("%d/%d\n",k - n + 1 ,n);
		}
	}
	return 0;
}
